## Pandas

Pandas is a library for Data Analysis. Extremely powerful table (DataFrame) system built off of NumPy.

In [158]:
import pandas as pd
import numpy as np

### Series

One-dimensional ndarray with axis labels

In [159]:
ind = ['USA' , 'two' , 'IND']

In [160]:
dt = [0,1.3,2]

In [161]:
ser = pd.Series(data=dt, index = ind)
ser

USA    0.0
two    1.3
IND    2.0
dtype: float64

###### Creating using a dictionary

In [162]:
dic = {'one':1,'two':2,'three':3}

In [163]:
sr = pd.Series(dic)
sr

one      1
two      2
three    3
dtype: int64

In [164]:
# only two will show output because its the only index that is present in both series
print(ser*sr)

IND      NaN
USA      NaN
one      NaN
three    NaN
two      2.6
dtype: float64

In [165]:
ser.keys()

Index(['USA', 'two', 'IND'], dtype='object')

### Dataframe

A Pandas DataFrame consists of multiple Pandas Series that share index values.

In [166]:
# Creating a dataframe

dt = np.random.randint(1,9,(3,3))
dt

array([[5, 8, 7],
       [7, 8, 6],
       [6, 2, 6]])

In [167]:
ind = ['dan' , 'asa', 'bsd']

In [168]:
col = ['c1', 'c2', 'c3']

In [169]:
df = pd.DataFrame(data=dt,index = ind,columns= col)
df

     c1  c2  c3
dan   5   8   7
asa   7   8   6
bsd   6   2   6

In [170]:
df.head()

     c1  c2  c3
dan   5   8   7
asa   7   8   6
bsd   6   2   6

In [171]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, dan to bsd
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      3 non-null      int32
 1   c2      3 non-null      int32
 2   c3      3 non-null      int32
dtypes: int32(3)
memory usage: 60.0+ bytes

In [172]:
df.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [173]:
df.isnull().sum()

c1    0
c2    0
c3    0
dtype: int64

In [174]:
df.describe()

        c1        c2        c3
count  3.0  3.000000  3.000000
mean   6.0  6.000000  6.333333
std    1.0  3.464102  0.577350
min    5.0  2.000000  6.000000
25%    5.5  5.000000  6.000000
50%    6.0  8.000000  6.000000
75%    6.5  8.000000  6.500000
max    7.0  8.000000  7.000000

In [175]:
df['c1']

dan    5
asa    7
bsd    6
Name: c1, dtype: int32

In [176]:
df['c4'] = df['c1'] + df['c2']
df['c4']

dan    13
asa    15
bsd     8
Name: c4, dtype: int32

In [177]:
df

     c1  c2  c3  c4
dan   5   8   7  13
asa   7   8   6  15
bsd   6   2   6   8

In [178]:
df = df.drop('c4',axis=1)
df

     c1  c2  c3
dan   5   8   7
asa   7   8   6
bsd   6   2   6

In [179]:
rw = df.iloc[1]
rw

c1    7
c2    8
c3    6
Name: asa, dtype: int32

In [180]:
df = df.drop('asa')

In [181]:
df

     c1  c2  c3
dan   5   8   7
bsd   6   2   6

In [184]:
df.append(rw)

C:\Users\dania\AppData\Local\Temp\ipykernel_10288\803260814.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(rw)

     c1  c2  c3
dan   5   8   7
bsd   6   2   6
asa   7   8   6